[
    {
      "category": "Night One",
      "subcategory": "Deny Trauma",
      "content": "Adler denies the concept of trauma, stating that the meaning we assign to our experiences determines their impact.",
      "quotes": [
        "No experience is in itself a cause of our success or failure. We are not determined by our experiences, but the meaning we give them is self-determining."
      ],
      "takeaway": "Your past doesn’t define you; the meaning you give it does."
    },
    {
      "category": "Night Two",
      "subcategory": "Interpersonal Relationships",
      "content": "All problems stem from interpersonal relationships. Loneliness stems not from being alone but from feeling excluded.",
      "quotes": [
        "Loneliness is having other people and society around you and feeling a deep sense of exclusion from them."
      ],
      "takeaway": "Focus on fostering genuine connections to address personal challenges."
    },
    {
      "category": "Night Three",
      "subcategory": "Separation of Tasks",
      "content": "To achieve happiness, separate your tasks from others'. For example, a child’s studying is their task, not the parents’.",
      "quotes": [
        "Whose task is this?"
      ],
      "takeaway": "Don't intrude on others' responsibilities; focus on what you can control."
    },
    {
      "category": "Night Four",
      "subcategory": "Community and Belonging",
      "content": "True happiness comes from belonging to a community and contributing to something greater than oneself.",
      "quotes": [
        "The sense of belonging is something one acquires by one's own efforts, not something endowed at birth."
      ],
      "takeaway": "Building connections and contributing to your community are essential for fulfillment."
    },
    {
      "category": "Night Five",
      "subcategory": "Here and Now",
      "content": "Living in the present requires avoiding unnecessary praise or rebuke, as they create unhealthy interpersonal dynamics.",
      "quotes": [
        "One must not praise, and one must not rebuke."
      ],
      "takeaway": "Treat others as equals; focus on genuine interactions."
    },
    {
      "category": "Key Principles",
      "subcategory": "Teleology vs. Etiology",
      "content": "Adler focuses on Teleology: the purpose of behaviors rather than their causes.",
      "quotes": [
        "People are not driven by past causes but move toward goals they set themselves."
      ],
      "takeaway": "Focus on present goals rather than past causes to move forward."
    },
    {
      "category": "Philosophical Ideas",
      "subcategory": "Inferiority Complex",
      "content": "Inferiority complex arises from seeking superiority over others, leading to competition and unhappiness.",
      "quotes": [
        "If one really has confidence in oneself, one doesn’t feel the need to boast."
      ],
      "takeaway": "Avoid comparing yourself to others; confidence comes from self-acceptance."
    },
    {
      "category": "Examples",
      "subcategory": "Parent-Child Relationships",
      "content": "A parent completing their child’s homework intrudes on the child’s task and hinders their growth.",
      "quotes": [
        "Studying is the child’s task. A parent’s commanding the child to study is an act of intruding on another person’s task."
      ],
      "takeaway": "Empower others by letting them handle their responsibilities."
    }
  ]
  